import pymysql

# 创建连接
con = pymysql.connect(
    host='192.168.0.11',
    user='user',
    password='123456',
    port=3306,
    database='test1',
    charset='utf8'
)
print('连接成功')
cursor = con.cursor()
data = "DROP TABLE IF exists `临时表_zhangwenshun_产能统计`;" \
       "CREATE TABLE `临时表_zhangwenshun_产能统计`" \
       "SELECT IFNULL (`开通-装维人员和用户班关联关系`.`区域`," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '松坪山|南山区','南山区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '盐田区|大鹏新','盐田区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '观澜街道|锦绣江南|龙华新区|公明街道|龙华区|光明新区|光明区|大浪街道|民治街道|龙华街道','龙华区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '深汕特别合作','深汕区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '宝安区','宝安区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '福田区','福田区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '罗湖区','罗湖区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '龙岗区','龙岗区'," \
       "IF (`开通-5.0全量隔夜`.`标准地址` REGEXP '坪山区|坪山新区','坪山区','松坪山|南山区','南山区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '盐田区|大鹏新','盐田区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '观澜街道|锦绣江南|龙华新区|公明街道|龙华区|光明新区|光明区|大浪街道|民治街道|龙华街道','龙华区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '深汕特别合作','深汕区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '宝安区','宝安区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '福田区','福田区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '罗湖区','罗湖区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '龙岗区','龙岗区'," \
       "IF (`开通-5.0全量隔夜`.`五级地址名称` REGEXP '坪山区|坪山新区', '坪山区', '无归属' ))))))))))))))))))) AS '匹配区域'," \
       "IFNULL(`开通-装维人员和用户班关联关系`.`装维站`, '无归属') AS '装维站'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`客户类型` = '个人客户' " \
       "AND `开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND IF (`开通-5.0全量隔夜`.`宽带账号` REGEXP '38800', 1, 0) = 1, '新增388宽带'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`客户类型` = '个人客户' " \
       "AND `开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND IF (`开通-5.0全量隔夜`.`宽带账号` REGEXP '38800', 1, 0) = 0, '手机开通的宽带'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`客户类型` = '个人客户' " \
       "AND `开通-5.0全量隔夜`.`操作类型` = '移机', '移机宽带'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`客户类型` = '商业客户' " \
       "AND `开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND IF (`开通-5.0全量隔夜`.`宽带账号` REGEXP '38800', 1, 0) = 1, '388开通的商宽'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`客户类型` = '商业客户' " \
       "AND `开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND IF (`开通-5.0全量隔夜`.`宽带账号` REGEXP '38800', 1, 0) = 0, '手机号码开通的商宽'," \
       "IF (`开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND `开通-5.0全量隔夜`.`是否同装` = '是' " \
       "AND IF (`开通-5.0全量隔夜`.`产品名称` REGEXP '电视基础产品', 1, 0) = 1, '同装的电视业务'," \
       "IF (`开通-5.0全量隔夜`.`操作类型` = '开通' " \
       "AND `开通-5.0全量隔夜`.`是否同装` = '是' " \
       "AND IF (`开通-5.0全量隔夜`.`产品名称` REGEXP '全屋光网基础产品', 1, 0) = 1, '同装的FTTR业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '智能安防基础产品' " \
       "AND `开通-5.0全量隔夜`.`是否同装` = '是', '同装的安防业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '全屋WIFI基础产品' " \
       "AND `开通-5.0全量隔夜`.`是否同装` = '是', '同装的组网业务'," \
       "IF (IF (`开通-5.0全量隔夜`.`产品名称` REGEXP '电视基础产品', 1, 0) = 1 " \
       "AND IF (`开通-5.0全量隔夜`.`是否同装` REGEXP '是', 1, 0) = 0, '加装的电视业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '全屋光网基础产品' " \
       "AND IF (`开通-5.0全量隔夜`.`是否同装` REGEXP '是', 1, 0) = 0, '加装的FTTR业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '智能安防基础产品' " \
       "AND IF (`开通-5.0全量隔夜`.`是否同装` REGEXP '是', 1, 0) = 0, '加装的安防业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '全屋WIFI基础产品' " \
       "AND IF (`开通-5.0全量隔夜`.`是否同装` REGEXP '是', 1, 0) = 0, '加装的组网业务'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` = '智能门锁基础产品', '门锁业务'," \
       "IF (`开通-5.0全量隔夜`.`操作类型` = '速率变更' " \
       "AND `开通-5.0全量隔夜`.`资源类型` = '自建宽带' " \
       "AND `开通-5.0全量隔夜`.`工单状态` in ('定单完成', '工单报竣', '工单归档') " \
       "AND `开通-5.0全量隔夜`.`是否实际上门` = '是', '上门的提速工单', '其他'))))))))))))))) AS '类型'," \
       "IF (`开通-5.0全量隔夜`.`产品名称` in ('手机宽带', '个人宽带') " \
       "AND `开通-5.0全量隔夜`.`是否装维下单` = '是', '是', '否') AS '随销宽带'," \
       "`开通-5.0全量隔夜`.`定单流水号`," \
       "`开通-5.0全量隔夜`.`装维人员登录账号`," \
       "`开通-5.0全量隔夜`.`报竣时间`," \
       "`开通-5.0全量隔夜`.`操作类型`," \
       "`开通-5.0全量隔夜`.`产品名称`," \
       "`开通-5.0全量隔夜`.`客户类型`," \
       "`开通-5.0全量隔夜`.`资源类型`," \
       "`开通-5.0全量隔夜`.`工单状态`," \
       "`开通-5.0全量隔夜`.`宽带账号`," \
       "`开通-5.0全量隔夜`.`是否同装`," \
       "`开通-5.0全量隔夜`.`是否装维下单`," \
       "`开通-5.0全量隔夜`.`是否实际上门` FROM `开通-5.0全量隔夜`" \
       "LEFT JOIN `开通-装维人员和用户班关联关系` ON " \
       "`开通-5.0全量隔夜`.`装维人员登录账号` = `开通-装维人员和用户班关联关系`.`装维账号` " \
       "WHERE " \
       "`开通-5.0全量隔夜`.`报竣时间` BETWEEN '2023-04-01' AND '2023-05-01' " \
       "AND `开通-5.0全量隔夜`.`资源类型` = '自建宽带' " \
       "AND `开通-5.0全量隔夜`.`操作类型` != '拆除' " \
       "AND `开通-5.0全量隔夜`.`工单状态` in ('定单完成', '工单报竣', '工单归档');" \
 \
# -- 工作站产能

# -- 月产能
"SELECT `汇总`.`匹配区域`,`汇总`.`装维站`," \
"'装维站' AS '装维人员登录账号'," \
"'工作站月产能' AS '类型'," \
"SUM( IF ( `汇总`.`类型` = '新增388宽带', `汇总`.`类型数量`, 0 ) ) AS '新增388宽带'," \
"SUM( IF ( `汇总`.`类型` = '手机开通的宽带', `汇总`.`类型数量`, 0 ) ) AS '手机开通的宽带'," \
"SUM( IF ( `汇总`.`类型` = '移机宽带', `汇总`.`类型数量`, 0 ) ) AS '移机宽带'," \
"SUM( IF ( `汇总`.`类型` = '388开通的商宽', `汇总`.`类型数量`, 0 ) ) AS '388开通的商宽'," \
"SUM( IF ( `汇总`.`类型` = '手机号码开通的商宽', `汇总`.`类型数量`, 0 ) ) AS '手机号码开通的商宽'," \
"SUM( IF ( `汇总`.`类型` = '同装的电视业务', `汇总`.`类型数量`, 0 ) ) AS '同装的电视业务'," \
"SUM( IF ( `汇总`.`类型` = '同装的FTTR业务', `汇总`.`类型数量`, 0 ) ) AS '同装的FTTR业务'," \
"SUM( IF ( `汇总`.`类型` = '同装的安防业务', `汇总`.`类型数量`, 0 ) ) AS '同装的安防业务'," \
"SUM( IF ( `汇总`.`类型` = '同装的组网业务', `汇总`.`类型数量`, 0 ) ) AS '同装的组网业务'," \
"SUM( IF ( `汇总`.`类型` = '加装的电视业务', `汇总`.`类型数量`, 0 ) ) AS '加装的电视业务'," \
"SUM( IF ( `汇总`.`类型` = '加装的FTTR业务', `汇总`.`类型数量`, 0 ) ) AS '加装的FTTR业务'," \
"SUM( IF ( `汇总`.`类型` = '加装的安防业务', `汇总`.`类型数量`, 0 ) ) AS '加装的安防业务'," \
"SUM( IF ( `汇总`.`类型` = '加装的组网业务', `汇总`.`类型数量`, 0 ) ) AS '加装的组网业务'," \
"SUM( IF ( `汇总`.`类型` = '门锁业务', `汇总`.`类型数量`, 0 ) ) AS '门锁业务'," \
"SUM( IF ( `汇总`.`类型` = '上门的提速工单', `汇总`.`类型数量`, 0 ) ) AS '上门的提速工单'," \
"SUM( IF ( `汇总`.`随销宽带` = '是', `汇总`.`随销宽带数量`, 0 ) ) AS '随销宽带'" \
"FROM (SELECT COUNT(`明细`.`类型`) AS '类型数量'," \
"SUM( IF( `明细`.`随销宽带` = '是', 1, 0 ) ) AS '随销宽带数量'," \
"`明细`.`匹配区域`," \
"`明细`.`装维站`," \
"`明细`.`类型`," \
"`明细`.`随销宽带`," \
"`明细`.`定单流水号` " \
"FROM " \
"`临时表_zhangwenshun_产能统计` AS `明细` " \
"GROUP BY " \
"`匹配区域`," \
"`装维站`," \
"`类型`," \
"`随销宽带` " \
"ORDER " \
"BY " \
"`匹配区域`," \
"`装维站`," \
"`类型`," \
"`随销宽带`) AS " \
"`汇总`" \
"GROUP " \
"BY " \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站` " \
"ORDER " \
"BY " \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`;" \

# -- 日产能
"SELECT" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"'装维站'" \
"AS" \
"'装维人员登录账号'," \
"'工作站日产能'" \
"AS" \
"'类型'," \
"SUM(IF(`汇总`." \
"`类型` = '新增388宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'新增388宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '手机开通的宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机开通的宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '移机宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'移机宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '388开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'388开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '手机号码开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机号码开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '门锁业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'门锁业务'," \
"SUM(IF(`汇总`." \
"`类型` = '上门的提速工单', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'上门的提速工单'," \
"SUM(IF(`汇总`." \
"`随销宽带` = '是', `汇总`." \
"`随销宽带数量`, 0 ) ) AS" \
"'随销宽带'" \
"FROM(SELECT" \
"COUNT(`明细`." \
"`类型`) AS" \
"'类型数量'," \
"SUM(IF(`明细`." \
"`随销宽带` = '是', 1, 0 ) ) AS" \
"'随销宽带数量'," \
"`明细`." \
"`匹配区域`," \
"`明细`." \
"`装维站`," \
"`明细`." \
"`类型`," \
"`明细`." \
"`随销宽带`," \
"`明细`." \
"`定单流水号`" \
"FROM" \
"`临时表_zhangwenshun_产能统计`" \
"AS" \
"`明细`" \
"WHERE" \
"`明细`." \
"`报竣时间`" \
"BETWEEN" \
"'2023-04-17'" \
"AND" \
"'2023-04-18'" \
"GROUP" \
"BY" \
"`匹配区域`," \
"`装维站`," \
"`类型`," \
"`随销宽带`" \
"ORDER" \
"BY" \
"`匹配区域`," \
"`装维站`," \
"`类型`," \
"`随销宽带`) AS" \
"`汇总`" \
"GROUP" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`" \
"ORDER" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`;" \

# -- 人员产能

# -- 月产能
"SELECT" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`," \
"'人员月产能'" \
"AS" \
"'类型'," \
"SUM(IF(`汇总`." \
"`类型` = '新增388宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'新增388宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '手机开通的宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机开通的宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '移机宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'移机宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '388开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'388开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '手机号码开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机号码开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '门锁业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'门锁业务'," \
"SUM(IF(`汇总`." \
"`类型` = '上门的提速工单', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'上门的提速工单'," \
"SUM(IF(`汇总`." \
"`随销宽带` = '是', `汇总`." \
"`随销宽带数量`, 0 ) ) AS" \
"'随销宽带'" \
"FROM(SELECT" \
"COUNT(`明细`." \
"`类型`) AS" \
"'类型数量'," \
"SUM(IF(`明细`." \
"`随销宽带` = '是', 1, 0 ) ) AS" \
"'随销宽带数量'," \
"`明细`." \
"`装维人员登录账号`," \
"`明细`." \
"`匹配区域`," \
"`明细`." \
"`装维站`," \
"`明细`." \
"`类型`," \
"`明细`." \
"`随销宽带`," \
"`明细`." \
"`定单流水号`" \
"FROM" \
"`临时表_zhangwenshun_产能统计`" \
"AS" \
"`明细`" \
"GROUP" \
"BY" \
"`装维人员登录账号`," \
"`随销宽带`," \
"`类型`" \
"ORDER" \
"BY" \
"`装维人员登录账号`," \
"`随销宽带`," \
"`类型`) AS" \
"`汇总`" \
"GROUP" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`" \
"ORDER" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`;" \

# -- 日产能
"SELECT" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`," \
"'人员日产能'" \
"AS" \
"'类型'," \
"SUM(IF(`汇总`." \
"`类型` = '新增388宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'新增388宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '手机开通的宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机开通的宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '移机宽带', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'移机宽带'," \
"SUM(IF(`汇总`." \
"`类型` = '388开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'388开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '手机号码开通的商宽', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'手机号码开通的商宽'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '同装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'同装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的电视业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的电视业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的FTTR业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的FTTR业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的安防业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的安防业务'," \
"SUM(IF(`汇总`." \
"`类型` = '加装的组网业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'加装的组网业务'," \
"SUM(IF(`汇总`." \
"`类型` = '门锁业务', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'门锁业务'," \
"SUM(IF(`汇总`." \
"`类型` = '上门的提速工单', `汇总`." \
"`类型数量`, 0 ) ) AS" \
"'上门的提速工单'," \
"SUM(IF(`汇总`." \
"`随销宽带` = '是', `汇总`." \
"`随销宽带数量`, 0 ) ) AS" \
"'随销宽带'" \
"FROM(SELECT" \
"COUNT(`明细`." \
"`类型`) AS" \
"'类型数量'," \
"SUM(IF(`明细`." \
"`随销宽带` = '是', 1, 0 ) ) AS" \
"'随销宽带数量'," \
"`明细`." \
"`装维人员登录账号`," \
"`明细`." \
"`匹配区域`," \
"`明细`." \
"`装维站`," \
"`明细`." \
"`类型`," \
"`明细`." \
"`随销宽带`," \
"`明细`." \
"`定单流水号`" \
"FROM" \
"`临时表_zhangwenshun_产能统计`" \
"AS" \
"`明细`" \
"WHERE" \
"`明细`." \
"`报竣时间`" \
"BETWEEN '2023-04-17' AND '2023-04-18' " \
"GROUP" \
"BY" \
"`装维人员登录账号`," \
"`随销宽带`," \
"`类型`" \
"ORDER" \
"BY" \
"`装维人员登录账号`," \
"`随销宽带`," \
"`类型`) AS" \
"`汇总`" \
"GROUP" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`" \
"ORDER" \
"BY" \
"`汇总`." \
"`匹配区域`," \
"`汇总`." \
"`装维站`," \
"`汇总`." \
"`装维人员登录账号`;"
cursor.execute(data)
cursor.close()
con.close()
